---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCHybridImport.CreateMap(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
source: html/42b95227-2e47-e5a5-91a6-cee54975e818.htm
---
# Autodesk.Revit.DB.IFC.IFCHybridImport.CreateMap Method

## Syntax (C#)
```csharp
public IDictionary<IFCGuidKey, ElementId> CreateMap(
	Document doc,
	IList<ElementId> elementIds
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`)
- **elementIds** (`System.Collections.Generic.IList < ElementId >`)